app/controllers/invoices/purchases_controller.rb

SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def new
    @invoice = Invoice.find(params[:invoice_id])

SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "purchases" ("product", "category", "quantity", "invoice_id", "created_at", "updated_at", "price") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @invoice = Invoice.find(params[:invoice_id])
    @purchase = Purchase.new(purchase_params)
    @purchase.invoice = @invoice

    respond_to do |format|
      if @purchase.save

SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "purchases".* FROM "purchases" WHERE "purchases"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "purchases" WHERE "purchases"."id" = ?  [["id", 4]]
---
  def destroy
    @invoice = Invoice.find(params[:invoice_id])
    @purchase = Purchase.find(params[:id])
    title = @purchase.product

    if @purchase.destroy