app/views/invoices/_form.html.erb


    <%= collection_select(:invoice,:customer_id, Customer.all, :id, :name,{}, {:multiple=>false})%>
---
SELECT "customers".* FROM "customers"