app/controllers/customers_controller.rb

INSERT INTO "customers" ("name", "phone", "email", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save

UPDATE "customers" SET "name" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["name", "Nguyễn Văn Anh"], ["updated_at", "2021-06-01 04:47:17.928305"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @customer.update(customer_params)