app/controllers/invoices_controller.rb

  def create
    @invoice = Invoice.new(invoice_params)

    respond_to do |format|
      if @invoice.save
---
INSERT INTO "invoices" ("date", "customer_id", "tax", "phone", "saleperson", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    @invoice.destroy
---
DELETE FROM "invoices" WHERE "invoices"."id" = ?  [["id", 2]]

    def set_invoice
      @invoice = Invoice.find(params[:id])
---
SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]